Project/Toir/src/Reports/гкс_ФайлыДО/гкс_ФайлыДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>гкс_ФайлыДО</name>
  <comment>TOIR20-217</comment>
  <attributes>
    <name>АктыОВыполненииЭтапаРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыявленныеДефекты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкиНаРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоСФайлами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Report>

Project/Toir/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВыявленныеДефекты</name>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.торо_СостоянияОбъектовРемонта</basedOn>
  <basedOn>Document.торо_УчетКонтролируемыхПоказателей</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Влияние</name>
    <type>
      <types>EnumRef.гкс_Влияние</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДефектОформленПоТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НарядЗаданиеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <comment>TOIR20-576</comment>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОписаниеДефектаСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СпециализацияТехническогоСпециалиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СрочностьВоздействия</name>
    <comment>8220 Тарасов</comment>
    <type>
      <types>EnumRef.гкс_СрочностьВоздействия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_IDОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.торо_ВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйОбъект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СимптомДефекта</name>
      <type>
        <types>CatalogRef.гкс_СимптомыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_КорневаяПричина</name>
      <type>
        <types>CatalogRef.гкс_КорневыеПричины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныеЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <attributes>
      <name>ID_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ФайлыФиксации</name>
    <comment>TOIR20-598</comment>
    <attributes>
      <name>НаименованиеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Reports/гкс_ФайлыДО/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Не (АктыОВыполненииЭтапаРабот ИЛИ ВыявленныеДефекты ИЛИ ЗаявкиНаРемонт) Тогда
		Возврат;		
	КонецЕсли; 
	
	ТзСсылкыНаДокументы = Новый ТаблицаЗначений;
	ТзСсылкыНаДокументы.Колонки.Добавить("СсылкаНаДокумент");
	ТзСсылкыНаДокументы.Колонки.Добавить("ГУИД");
 	ТзСсылкыНаДокументы.Колонки.Добавить("Порядок");
   
	Прокси = ИнтеграцияС1СДокументооборотПовтИсп.ПолучитьПрокси();
	
	ЗапросДО = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "DMGetFileListRequest");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
	
	Запрос.Текст = СформироватьТекстЗапроса();
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ГУИД = Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор());
		
		СтрокаТЗ = ТзСсылкыНаДокументы.Добавить();
		СтрокаТЗ.СсылкаНаДокумент = ВыборкаДетальныеЗаписи.Ссылка; 
		СтрокаТЗ.ГУИД = ГУИД;
		СтрокаТЗ.Порядок = ВыборкаДетальныеЗаписи.Порядок;
		
		ОбъектВладелец = ИнтеграцияС1СДокументооборот.СоздатьОбъект(Прокси, "ExternalObject");  		
		ОбъектВладелец.name = ВыборкаДетальныеЗаписи.Представление;
		ОбъектВладелец.id = ГУИД;
		ОбъектВладелец.type = "Документ." + ВыборкаДетальныеЗаписи.Ссылка.Метаданные().Имя;
		
		ЗапросДО.externalObjects.Добавить(ОбъектВладелец);
		
	КонецЦикла;
	
	ЗапросДО.columnSet.Добавить("objectId");
	ЗапросДО.columnSet.Добавить("owner");
	
	Файлы = Прокси.execute(ЗапросДО);		
	
	МояТаблица = ВернутьТаблицу(Файлы);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("СсылкиНаДокументы", ТзСсылкыНаДокументы);
	ВнешниеНаборыДанных.Вставить("ИДФайлы", МояТаблица);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТекстЗапроса()
	
	ТекстЗапроса = "";
	Если АктыОВыполненииЭтапаРабот Тогда
		ТекстЗапроса =	"ВЫБРАТЬ
		              	|	торо_АктОВыполненииЭтапаРабот.Ссылка КАК Ссылка,
		              	|	торо_АктОВыполненииЭтапаРабот.Представление КАК Представление,
		              	|	торо_АктОВыполненииЭтапаРабот.МоментВремени КАК МоментВремени,
		              	|	1 КАК Порядок
		              	|ИЗ
		              	|	Документ.торо_АктОВыполненииЭтапаРабот КАК торо_АктОВыполненииЭтапаРабот
		              	|ГДЕ
		              	|	торо_АктОВыполненииЭтапаРабот.Дата МЕЖДУ &ДатаНач И &ДатаКон";
 		
	КонецЕсли; 
	
	Если ВыявленныеДефекты Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + 	"
											 |ОБЪЕДИНИТЬ ВСЕ
											 |";			
		КонецЕсли; 		
		ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		                              |	торо_ВыявленныеДефекты.Ссылка КАК Ссылка,
		                              |	торо_ВыявленныеДефекты.Представление КАК Представление,
		                              |	торо_ВыявленныеДефекты.МоментВремени КАК МоментВремени,
		                              |	2 КАК Порядок
		                              |ИЗ
		                              |	Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
		                              |ГДЕ
		                              |	торо_ВыявленныеДефекты.Дата МЕЖДУ &ДатаНач И &ДатаКон";

	КонецЕсли; 
	
	Если ЗаявкиНаРемонт Тогда
		Если ТекстЗапроса <> "" Тогда
			ТекстЗапроса = ТекстЗапроса + 	"
											 |ОБЪЕДИНИТЬ ВСЕ
											 |";			
		КонецЕсли; 		
		ТекстЗапроса = ТекстЗапроса + "	ВЫБРАТЬ
										|	торо_ЗаявкаНаРемонт.Ссылка,
										|	торо_ЗаявкаНаРемонт.Представление,
										|	торо_ЗаявкаНаРемонт.МоментВремени,
		                                |	3 КАК Порядок
										|ИЗ
										|	Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
										|ГДЕ
										|	торо_ЗаявкаНаРемонт.Дата МЕЖДУ &ДатаНач И &ДатаКон ";

	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + "
								|УПОРЯДОЧИТЬ ПО
								|	МоментВремени УБЫВ";
	
	Возврат ТекстЗапроса;
									
КонецФункции

Функция ВернутьТаблицу(Файлы)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ГУИД");
	ТЗ.Колонки.Добавить("ФайлИД");
	
	Для каждого ТекФайл Из Файлы.files Цикл
		НоваяСтрока = ТЗ.Добавить();	
		НоваяСтрока.ГУИД = ТекФайл.owner.externalObject.id;
		НоваяСтрока.ФайлИД = ТекФайл.objectID.id;
	КонецЦикла;
	
	Возврат ТЗ; 
		
КонецФункции
 
#КонецОбласти
